Xinyuan-LilyGO/T-Halow-P4/examples/halow_node/sdkconfig.defaults
# # This file was generated using idf.py save-defconfig. It can be edited manually.
# # Espressif IoT Development Framework (ESP-IDF) 5.3.0 Project Minimal Configuration

# #######################################################

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_ESP32P4_REV_MIN_0=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# The P4's 768 KB of SRAM is shared between the L2 cache and the heap, so the
# 512 KB cache the other examples use leaves only ~40 KB of internal heap free
# at boot -- and the hardware H.264 encoder wants a ~90 KB reference frame
# (1152 * macroblock-width) that it will only take from internal memory.
# Halving the cache buys back 256 KB of SRAM, which is what makes the camera
# pipeline fit at 720p.
CONFIG_CACHE_L2_CACHE_256KB=y
# CONFIG_CACHE_L2_CACHE_512KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# NAT between the WiFi SoftAP and the HaLow link.
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y

# OTA: roll back automatically if a new image never marks itself valid
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Camera streaming: CSI capture -> ISP -> hardware H.264 (camera_stream.cpp).
# Sensor mode matches the shipped module (OV2710, verified on hardware).
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_DISABLE_MIPI_CSI_DRIVER_BACKUP_BUFFER=y
CONFIG_ESP_VIDEO_ENABLE_ISP=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
# Hardware JPEG too: a browser can display MJPEG natively but not raw H.264,
# so focusing the lens from a phone needs this path.
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_VIDEO_DEVICE=y
# Each video device claims a VFS entry (/dev/video0, video10, video11, plus
# the ISP device); with the console and SPIFFS the default table of 8 is
# already full, and the last device to register just fails.
CONFIG_VFS_MAX_COUNT=16
CONFIG_CAMERA_OV2710=y
CONFIG_CAMERA_OV2710_AUTO_DETECT=y
CONFIG_CAMERA_OV2710_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV2710_MIPI_RAW10_1280X720_25FPS=y
CONFIG_CAMERA_OV2710_MIPI_IF_FORMAT_INDEX_DAFAULT=1

# Let the home LAN reach the camera's stream through the gateway's NAT.
CONFIG_LWIP_IPV4_NAPT_PORTMAP=y
